In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.rand( 4,3)
data

array([[0.13468836, 0.28124103, 0.54791342],
       [0.44939766, 0.34775794, 0.50227532],
       [0.723141  , 0.14734507, 0.79865011],
       [0.37474377, 0.47350772, 0.26110931]])

In [3]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  0.134688  0.281241  0.547913
1  0.449398  0.347758  0.502275
2  0.723141  0.147345  0.798650
3  0.374744  0.473508  0.261109

In [4]:
dataFrame[0]

0    0.134688
1    0.449398
2    0.723141
3    0.374744
Name: 0, dtype: float64

In [7]:
newDF = pd.DataFrame(data, index=["Huseyin","Ali","Ismail","Veli"],columns=["Worked hours","Age","Salary"])
newDF

         Worked hours       Age    Salary
Huseyin      0.134688  0.281241  0.547913
Ali          0.449398  0.347758  0.502275
Ismail       0.723141  0.147345  0.798650
Veli         0.374744  0.473508  0.261109

## call columns

In [8]:
newDF["Age"]

Huseyin    0.281241
Ali        0.347758
Ismail     0.147345
Veli       0.473508
Name: Age, dtype: float64

In [9]:
newDF["Worked hours"]

Huseyin    0.134688
Ali        0.449398
Ismail     0.723141
Veli       0.374744
Name: Worked hours, dtype: float64

In [10]:
newDF[["Age","Salary"]]

              Age    Salary
Huseyin  0.281241  0.547913
Ali      0.347758  0.502275
Ismail   0.147345  0.798650
Veli     0.473508  0.261109

In [12]:
newDF[["Salary"]]

           Salary
Huseyin  0.547913
Ali      0.502275
Ismail   0.798650
Veli     0.261109

## call rows

In [14]:
newDF.loc["Huseyin"]

Worked hours    0.134688
Age             0.281241
Salary          0.547913
Name: Huseyin, dtype: float64

In [15]:
newDF.iloc[0]

Worked hours    0.134688
Age             0.281241
Salary          0.547913
Name: Huseyin, dtype: float64

In [16]:
newDF["Salary"]

Huseyin    0.547913
Ali        0.502275
Ismail     0.798650
Veli       0.261109
Name: Salary, dtype: float64

In [17]:
newDF["Retirement age"] = newDF["Age"] + newDF["Age"]

In [18]:
newDF

         Worked hours       Age    Salary  Retirement age
Huseyin      0.134688  0.281241  0.547913        0.562482
Ali          0.449398  0.347758  0.502275        0.695516
Ismail       0.723141  0.147345  0.798650        0.294690
Veli         0.374744  0.473508  0.261109        0.947015

In [20]:
newDF.drop("Retirement age",axis=1)

         Worked hours       Age    Salary
Huseyin      0.134688  0.281241  0.547913
Ali          0.449398  0.347758  0.502275
Ismail       0.723141  0.147345  0.798650
Veli         0.374744  0.473508  0.261109

In [21]:
newDF.drop("Ali",axis=0)

         Worked hours       Age    Salary  Retirement age
Huseyin      0.134688  0.281241  0.547913        0.562482
Ismail       0.723141  0.147345  0.798650        0.294690
Veli         0.374744  0.473508  0.261109        0.947015

In [22]:
newDF

         Worked hours       Age    Salary  Retirement age
Huseyin      0.134688  0.281241  0.547913        0.562482
Ali          0.449398  0.347758  0.502275        0.695516
Ismail       0.723141  0.147345  0.798650        0.294690
Veli         0.374744  0.473508  0.261109        0.947015

In [23]:
newDF.drop("Retirement age",axis=1,inplace=True)

In [24]:
newDF

         Worked hours       Age    Salary
Huseyin      0.134688  0.281241  0.547913
Ali          0.449398  0.347758  0.502275
Ismail       0.723141  0.147345  0.798650
Veli         0.374744  0.473508  0.261109

In [25]:
newDF.loc["Huseyin"]["Salary"]

0.5479134186238831

In [26]:
newDF.loc["Huseyin","Salary"]

0.5479134186238831

In [28]:
booleanDF = newDF < 0

In [29]:
newDF[booleanDF]

         Worked hours  Age  Salary
Huseyin           NaN  NaN     NaN
Ali               NaN  NaN     NaN
Ismail            NaN  NaN     NaN
Veli              NaN  NaN     NaN

In [30]:
newDF[newDF > 0.5]

         Worked hours  Age    Salary
Huseyin           NaN  NaN  0.547913
Ali               NaN  NaN  0.502275
Ismail       0.723141  NaN  0.798650
Veli              NaN  NaN       NaN

In [33]:
newDF["Age"] > 0.3

Huseyin    False
Ali         True
Ismail     False
Veli        True
Name: Age, dtype: bool

In [34]:
newDF[newDF["Age"]>0.3]

      Worked hours       Age    Salary
Ali       0.449398  0.347758  0.502275
Veli      0.374744  0.473508  0.261109

In [35]:
newDF

         Worked hours       Age    Salary
Huseyin      0.134688  0.281241  0.547913
Ali          0.449398  0.347758  0.502275
Ismail       0.723141  0.147345  0.798650
Veli         0.374744  0.473508  0.261109

In [36]:
newDF.reset_index()

     index  Worked hours       Age    Salary
0  Huseyin      0.134688  0.281241  0.547913
1      Ali      0.449398  0.347758  0.502275
2   Ismail      0.723141  0.147345  0.798650
3     Veli      0.374744  0.473508  0.261109

In [37]:
newDF["new index"] = ["a","b","c","d"]
newDF.set_index("new index")
#inplace yapabiliriz

           Worked hours       Age    Salary
new index
a              0.134688  0.281241  0.547913
b              0.449398  0.347758  0.502275
c              0.723141  0.147345  0.798650
d              0.374744  0.473508  0.261109

In [38]:
newDF

         Worked hours       Age    Salary new index
Huseyin      0.134688  0.281241  0.547913         a
Ali          0.449398  0.347758  0.502275         b
Ismail       0.723141  0.147345  0.798650         c
Veli         0.374744  0.473508  0.261109         d

## Multi index

In [39]:
firstIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
secondIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]
joindedIndex = list(zip(firstIndex,secondIndex))
joindedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [40]:
joindedIndex = pd.MultiIndex.from_tuples(joindedIndex)
joindedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [46]:
randomArray = np.random.rand(6,2)

In [47]:
cartoonDF = pd.DataFrame(data=randomArray,index=joindedIndex,columns=["School","Home"])

In [53]:
cartoonDF.loc["South Park"].loc["Kenny"]

School    0.574143
Home      0.389335
Name: Kenny, dtype: float64

In [56]:
cartoonDF.index.names = ["Cartoon name","name"]

In [57]:
cartoonDF

                        School      Home
Cartoon name name
Simpson      Homer    0.875827  0.896967
             Bart     0.854603  0.871368
             Marge    0.312077  0.240127
South Park   Cartman  0.702916  0.700509
             Kenny    0.574143  0.389335
             Kyle     0.712506  0.012026